import React, { Component } from "react";
import { View, Text, ScrollView } from "react-native";

class HW3 extends Component {
  render() {
    return (
      <View
        style={{
          flex: 1,
          margin: 10,
          borderWidth: 2,
          borderColor: "rgb(1,87,95)",
          borderRadius: 3,
          alignSelf: "stretch"
        }}
      >
        <ScrollView>
          <Text style={{ fontSize: 25 }}>
            مراحل اجرای روش تاپ دان (TOP DOWN) به ترتیب زیر انجام می‌پذیرد: ۱-
            اجرای شمع‌های درجا به‌عنوان ستون‌های زیرزمین و سیستم سازه نگهبان
            پیرامونی ۲- انجام حفاری زمین تا تراز زیر پی و نصب ستون‌های پیش‌ساخته
            یا در جا بتنی یا فولادی ۳- اجرای هم‌زمان دیوارهای حائل و سقف طبقه
            همکف به همراه اجرای آب‌بند جهت آب‌های زیرزمینی با ترازبالا بسته به
            نیاز ۴- شروع خاک‌برداری از طبقه زیر همکف به‌صورت مرحله‌ای و
            آماده‌سازی جهت اجرای طبقه زیرزمین که در صورت داشتن تعداد طبقات
            زیرزمین بیشتر این فرایند تکرار می‌گردد. ۵- در مرحله آخر فونداسیون
            سازه اجراشده و بازشدگی‌های ایجادشده در دال سقف‌ها ( جهت انتقال خاک)
            بسته می‌شود و سازه زیرزمین تکمیل می‌گردد. مزایای روش تاپ دان (TOP
            DOWN Method) : افزایش سرعت ساخت و اتمام عملیات، به جهت پیشبرد
            هم‌زمان پروژه به‌طرف بالا و پایین بعد از اجرای سقف تراز همکف. حذف
            هزینه‌های سازه نگهبان و مهار گودها به روش‌های نیلینگ و انکراژ موجب
            صرفه‌جویی در منابع مالی پروژه می‌گردد. کاهش زمان ساخت منجر به کاهش
            هزینه‌های ساخت و ساز خواهد شد. کاهش سطوح آلودگی در محیط پروژه و محیط
            اطراف . عدم نیاز به اخذ رضایت همسایگان هم‌جوار و هزینه‌ها و مسائل
            حقوقی بعدی کاهش ریسک آسیب به ساختمان‌ها و سازه‌های مجاور به دلیل خود
            مهار بودن روش تاپ دان – روش بالا به پایین (TOP DOWN Method) روش
            اجرای معکوس کارایی بسیار بالای روش تاپ دان برای سازه‌هایی با تعداد
            طبقات زیرزمین زیاد همانند پارکینگ‌های طبقاتی و سازه‌های زیرزمینی
            مانند مترو و پل‌ها ، زیرگذرها با محدودیت ترافیکی . کاهش نشست خاک زیر
            پی ناشی از بار مرده ساختمان به دلیل اجراشدن فونداسیون در آخرین مرحله
            یادآور می‌شود نشست خاک زیر پی‌ها ازجمله مسائلی است که منجر به ایجاد
            ترک در دیوارها و سقف می‌گردد. به دلیل استفاده از اتصال مکانیکی،
            امکان اجرای عملیات آرماتوربندی و قالب‌بندی در فضای محدود نیز فراهم
            است. اجرای هم‌زمان عایق‌بندی پشت دیوارهای حائل که منجر به آب‌بند شدن
            کل قسمت مدفون سازه تا زیر فونداسیون هست. امکان اجرای عملیات در
            بدترین شرایط جوی به دلیل مدفون بودن سازه و زیرزمینی بودن امکان
            عمل‌آوری بهتر بتن سقف و تیرها به جهت مدفون بودن سازه و دوری از شرایط
            نامساعد جوی مانند هوای گرم و سرد: در تابستان منجر به تبخیر زودهنگام
            آب و در زمستان موجب جلوگیری از یخ‌زدگی بتن می‌شود. با اجرای اولین
            سقف(همکف) می‌توان فضای مناسبی جهت تجهیز کارگاه فراهم نمود. بنابراین
            استفاده از معابر و فضای خیابان نیز به حداقل خواهد رسید.
          </Text>
        </ScrollView>
      </View>
    );
  }
}
export { HW3 };
